Tekla.Structures.Analysis.AnalysisPart
The AnalysisPart class contains information related to analysis parts.

Tekla.Structures.Analysis.AnalysisPart._PartID
The identifier of the physical part.

Tekla.Structures.Analysis.AnalysisPart._PartName
The name of the physical part.

Tekla.Structures.Analysis.AnalysisPart._PartType
The type of the physical part.

Tekla.Structures.Analysis.AnalysisPart._Material
The material of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._Profile
The profile of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._OverrideProfile
The override profile of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._CoordinateSystem
The coordinate system of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._UpDirection
The up direction of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._Curvature
The curvature of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._AnalysisType
The analysis type of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartAnalysisProperties
The analysis part analysis properties.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartCompositeProperties
The analysis part composite properties.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartSpanningProperties
The analysis part spanning properties.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartLoadingProperties
The analysis part loading properties.

Tekla.Structures.Analysis.AnalysisPart._AnalysisDesignCode
The analysis design code of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartPositionProperties
The analysis part position properties.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartBarAttributes
The analysis part bar attributes.

Tekla.Structures.Analysis.AnalysisPart._AnalysisPartAreaAttributes
The analysis part area attributes.

Tekla.Structures.Analysis.AnalysisPart._LoadBearingOrder
The load bearing order.

Tekla.Structures.Analysis.AnalysisPart._SnapDistance
The snap distance.

Tekla.Structures.Analysis.AnalysisPart._AnalysisBars
The analysis bars of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._AnalysisAreas
The analysis areas of the analysis part.

Tekla.Structures.Analysis.AnalysisPart._AnalysisVolumes
The analysis volumes of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.PartID
The identifier of the physical part.

Tekla.Structures.Analysis.AnalysisPart.PartName
The name of the physical part.

Tekla.Structures.Analysis.AnalysisPart.PartType
The type of the physical part.

Tekla.Structures.Analysis.AnalysisPart.Material
The material of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.Profile
The profile of the analysis part. Note: OverrideProfile may exist to replace this.
In case of tapered profile, only the name is available, ID is 0 and values are not returned.
More details are available in the start/end properties of the analysis members.

Tekla.Structures.Analysis.AnalysisPart.OverrideProfile
The override profile of the analysis part.
In case of tapered profile, only the name is available,
and more details are available in the start/end properties of the analysis members.

Tekla.Structures.Analysis.AnalysisPart.CoordinateSystem
The coordinate system of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.UpDirection
The up direction of the analysis part (in the global coordinate system).
The axis vector (connecting member end nodes) and the up direction vector define the local XY plane of the member.
The local Z can be calculated as localZ = localX x UpDirection (cross product),
and after this localY = localZ x localX (cross product).

Tekla.Structures.Analysis.AnalysisPart.Curvature
The curvature of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.AnalysisType
The analysis type of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartAnalysisProperties
The analysis part analysis properties.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartCompositeProperties
The analysis part composite properties.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartSpanningProperties
The analysis part spanning properties.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartLoadingProperties
The analysis part loading properties.

Tekla.Structures.Analysis.AnalysisPart.AnalysisDesignCode
The analysis design code of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartPositionProperties
The analysis part position properties.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartBarAttributes
The analysis part bar attributes.

Tekla.Structures.Analysis.AnalysisPart.AnalysisPartAreaAttributes
The analysis part area attributes.

Tekla.Structures.Analysis.AnalysisPart.LoadBearingOrder
The load bearing order.

Tekla.Structures.Analysis.AnalysisPart.SnapDistance
The snap distance. Use 0.0 for manual connectivity, positive value for automatic connectivity.

Tekla.Structures.Analysis.AnalysisPart.AnalysisBars
The analysis bars of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.AnalysisAreas
The analysis areas of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.AnalysisVolumes
The analysis volumes of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.Insert
Inserts a new analysis part into the Tekla Structures model.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisPart.Select
Selects an analysis part.
The ID, or the PartID and the AnalysisModelName, has to be set.

Tekla.Structures.Analysis.AnalysisPart.Modify
Modifies an analysis part.
The ID, or the PartID and the AnalysisModelName, has to be set.

Tekla.Structures.Analysis.AnalysisPart.Delete
Deletes an analysis part.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisPart.GetAnalysisBars
Gets the analysis bars of the analysis part.
Returns: The analysis bars of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.GetAnalysisAreas
Gets the analysis areas of the analysis part.
Returns: The analysis areas of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.GetAnalysisVolumes
Gets the analysis volumes of the analysis part.
Returns: The analysis volumes of the analysis part.

Tekla.Structures.Analysis.AnalysisPart.Add(Tekla.Structures.Analysis.AnalysisBar)
Adds an analysis bar to the analysis part.
AnalysisBar: The analysis bar to be added.

Tekla.Structures.Analysis.AnalysisPart.Add(Tekla.Structures.Analysis.AnalysisArea)
Adds an analysis area to the analysis part.
AnalysisArea: The analysis area to be added.

Tekla.Structures.Analysis.AnalysisPart.IsMainPart
Check if this analysis part is a main analysis part (has sub analysis parts).
Returns: True if this analysis part is a main analysis part.

Tekla.Structures.Analysis.AnalysisPart.IsSubPart
Check if this analysis part is a sub analysis part.
Returns: True if this analysis part is a sub part.

Tekla.Structures.Analysis.AnalysisPart.GetMainParts
Get the main analysis parts of this analysis part.
There are no main analysis parts if this is not a sub analysis part.
Returns: The the main parts of this analysis part.

Tekla.Structures.Analysis.AnalysisPart.GetSubParts
Get the sub analysis parts of this analysis part.
There are no sub analysis parts if this is not a main analysis part.
Returns: The sub analysis parts of this analysis part.

Tekla.Structures.Analysis.AnalysisPart.MovePosition(Tekla.Structures.Analysis.AnalysisPosition,Tekla.Structures.Geometry3d.Vector)
Move analysis position.
position: The analysis position.
move: The move.
Returns: True if successful.

Tekla.Structures.Analysis.AnalysisPart.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.DeleteInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.CreateAnalysisBarEnumerator
Create analysis bar enumerator.

Tekla.Structures.Analysis.AnalysisPart.CreateAnalysisAreaEnumerator
Create analysis bar enumerator.

Tekla.Structures.Analysis.AnalysisPart.CreateAnalysisVolumeEnumerator
Create analysis bar enumerator.

Tekla.Structures.Analysis.AnalysisPart.CollectData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.AddAnalysisBar(Tekla.Structures.Analysis.AnalysisBar)
Add analysis bar

Tekla.Structures.Analysis.AnalysisPart.AddAnalysisArea(Tekla.Structures.Analysis.AnalysisArea)
Add analysis area

Tekla.Structures.Analysis.AnalysisPart.InsertBarData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.InsertAreaData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.ModifyData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.ModifyBarData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisPart.CreateSubPartsEnumerator
Create sub parts enumerator.
Returns: The sub parts enumerator.

Tekla.Structures.Analysis.AnalysisPart.CreateMainPartsEnumerator
Create main parts enumerator.
Returns: The main parts enumerator.